[
  {
    "id": "creatine_monohydrate_metabolic_energy_mitochondrial",
    "name": "Creatine Monohydrate",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Creatine is a small molecule that enters muscle and brain cells and connects to the cell’s energy storage system. When energy is used quickly, creatine helps recycle low-energy molecules back into usable energy. This keeps energy available during hard work or thinking. The fast-energy system becomes stronger and recovers faster. A person may notice more strength, better endurance, and clearer mental energy."
  },
  {
    "id": "alpha_lipoic_acid_ala_metabolic_energy_mitochondrial",
    "name": "Alpha-Lipoic Acid (ALA)",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Alpha-lipoic acid enters cells and moves into the parts that turn food into energy. It helps key enzymes work smoothly and also cleans up damaging byproducts created during energy production. This improves how sugar and fat are used as fuel. The energy system becomes more efficient and balanced. A person may notice steadier energy and better blood sugar control."
  },
  {
    "id": "magnesium_metabolic_role_metabolic_energy_mitochondrial",
    "name": "Magnesium (Metabolic Role)",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Magnesium is a mineral that binds to energy molecules so they can be used at all. Without magnesium, energy reactions slow or stop. When magnesium is present, hundreds of energy-making reactions run correctly. Cellular energy production becomes stable and reliable. A person may notice less fatigue and improved overall function."
  },
  {
    "id": "riboflavin_vitamin_b2_metabolic_energy_mitochondrial",
    "name": "Riboflavin (Vitamin B2)",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Riboflavin becomes part of helper molecules that move energy through the cell. These helpers carry electrons during energy production inside mitochondria. When riboflavin is available, energy flows smoothly without blockage. The cell’s power system runs more efficiently. A person may notice better stamina and reduced tiredness."
  },
  {
    "id": "niacinamide_vitamin_b3_metabolic_energy_mitochondrial",
    "name": "Niacinamide (Vitamin B3)",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Niacinamide is converted into NAD, a central energy carrier inside cells. NAD allows fuel from food to be turned into usable energy. When NAD levels are healthy, mitochondria keep producing energy without slowing down. Cellular repair and energy balance improve. A person may notice steadier energy and better recovery."
  },
  {
    "id": "omega_3_epa_dha_metabolic_energy_mitochondrial",
    "name": "Omega-3 (EPA/DHA)",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Omega-3 fats enter cell membranes and make them flexible and responsive. This improves how signals and nutrients move in and out of energy-producing structures. Omega-3s also reduce excess inflammation that interferes with energy production. Energy systems run with less friction. A person may notice improved endurance and reduced fatigue."
  },
  {
    "id": "coq10_pqq_metabolic_energy_mitochondrial",
    "name": "CoQ10 + PQQ",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "CoQ10 carries electrons inside mitochondria so energy can be produced. PQQ supports the creation and maintenance of mitochondria themselves. Together, they improve both energy flow and the health of energy-producing structures. Cells produce energy more reliably. A person may notice improved stamina and reduced exhaustion."
  },
  {
    "id": "acetyl_l_carnitine_metabolic_energy_mitochondrial",
    "name": "Acetyl-L-Carnitine",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Acetyl-L-carnitine carries fat into mitochondria where it can be burned for energy. This allows stored fuel to be used efficiently instead of building up. Energy production from fat increases and waste decreases. The brain and muscles receive steadier fuel. A person may notice mental clarity and physical energy."
  },
  {
    "id": "berberine_metabolic_energy_mitochondrial",
    "name": "Berberine",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Berberine enters cells and activates a fuel-sensing system that tells the body to use energy more carefully. This shifts metabolism toward burning fuel instead of storing it. Blood sugar handling improves and mitochondrial efficiency increases. Energy balance becomes more stable. A person may notice better glucose control and sustained energy."
  },
  {
    "id": "green_tea_extract_metabolic_energy_mitochondrial",
    "name": "Green Tea Extract",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Green tea compounds support mitochondria by reducing oxidative stress and gently increasing fat use for fuel. This helps energy production stay efficient without overstimulation. Metabolic pathways become cleaner and more responsive. A person may notice mild energy support and improved fat metabolism."
  },
  {
    "id": "shilajit_metabolic_energy_mitochondrial",
    "name": "Shilajit",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Shilajit provides mineral complexes that support mitochondrial enzymes. These enzymes help move energy through the cell’s power systems. With better enzyme support, energy production becomes more complete and efficient. Cells waste less fuel. A person may notice improved vitality and resilience."
  },
  {
    "id": "resveratrol_metabolic_energy_mitochondrial",
    "name": "Resveratrol",
    "category": "Metabolic / Energy / Mitochondrial",
    "mechanism": "Resveratrol activates cellular maintenance systems that protect mitochondria and improve their efficiency. It signals the cell to repair and preserve its energy-producing structures. Energy production becomes more sustainable over time. A person may notice improved metabolic health and long-term energy support."
  },

  {
    "id": "l_tyrosine_neurotransmitters_cognition_nervous_system",
    "name": "L-Tyrosine",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "L-tyrosine is an amino acid that enters the brain and is used to build dopamine and norepinephrine. These chemicals help the brain stay alert, motivated, and focused. When tyrosine is available, the brain can make these signals more easily during stress or effort. Signal strength stays stable instead of dropping. A person may notice improved focus, motivation, and mental stamina."
  },
  {
    "id": "lions_mane_neurotransmitters_cognition_nervous_system",
    "name": "Lion’s Mane",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Lion’s Mane contains compounds that signal nerve cells to grow and repair their connections. These signals support the structure of neurons and how they communicate with each other. Over time, nerve networks become healthier and more connected. The brain’s communication pathways stay flexible and resilient. A person may notice clearer thinking and better memory."
  },
  {
    "id": "alpha_gpc_neurotransmitters_cognition_nervous_system",
    "name": "Alpha-GPC",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Alpha-GPC supplies choline that easily enters the brain and is used to make acetylcholine. Acetylcholine is a key signal for learning, memory, and muscle control. When acetylcholine levels are supported, brain signaling becomes sharper and more precise. Communication between neurons improves. A person may notice better focus and mental clarity."
  },
  {
    "id": "cdp_choline_neurotransmitters_cognition_nervous_system",
    "name": "CDP-Choline",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "CDP-choline provides choline and cytidine, which help build both acetylcholine and brain cell membranes. This supports signaling and the physical structure of neurons at the same time. Brain cells maintain healthy communication surfaces. Cognitive processing becomes more efficient. A person may notice improved attention and mental endurance."
  },
  {
    "id": "b_complex_neurotransmitters_cognition_nervous_system",
    "name": "B-Complex",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "B vitamins support many steps that create and balance brain signaling chemicals. They help convert food into neurotransmitters and energy for nerve cells. When these steps run smoothly, the nervous system stays balanced instead of over- or under-active. Brain signaling remains steady. A person may notice more consistent mood and mental energy."
  },
  {
    "id": "taurine_neurotransmitters_cognition_nervous_system",
    "name": "Taurine",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Taurine acts as a calming signal in the nervous system and helps control how excited nerve cells become. It balances stimulation so signals do not fire too strongly. This protects neurons from overload and stress. Nervous system tone becomes smoother. A person may notice a calm but focused mental state."
  },
  {
    "id": "apigenin_neurotransmitters_cognition_nervous_system",
    "name": "Apigenin",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Apigenin interacts with calming receptors in the brain that reduce excessive nerve firing. This gently lowers mental overstimulation without shutting the brain down. Neural activity becomes quieter and more organized. The nervous system shifts toward rest and clarity. A person may notice reduced anxiety and easier relaxation."
  },
  {
    "id": "magnesium_nervous_system_role_neurotransmitters_cognition_nervous_system",
    "name": "Magnesium (Nervous System Role)",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Magnesium regulates how nerve signals enter and exit brain cells. It prevents excessive firing by blocking overactive signal channels. This keeps neurons from becoming overstimulated. Brain signaling stays controlled and efficient. A person may notice improved calmness and reduced mental tension."
  },
  {
    "id": "glycine_neurotransmitters_cognition_nervous_system",
    "name": "Glycine",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Glycine acts as a simple inhibitory signal that slows down nerve firing when needed. It helps the nervous system shift into rest and recovery states. Signal noise decreases and clarity improves. The brain transitions more easily into calm states. A person may notice better sleep quality and mental relaxation."
  },
  {
    "id": "l_theanine_neurotransmitters_cognition_nervous_system",
    "name": "L-Theanine",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "L-theanine increases calming brain waves while reducing stress-related signals. It balances alertness with relaxation rather than causing sedation. Brain activity becomes focused and smooth. Mental stress decreases without loss of clarity. A person may notice calm focus and reduced mental strain."
  },
  {
    "id": "ginkgo_biloba_neurotransmitters_cognition_nervous_system",
    "name": "Ginkgo Biloba",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Ginkgo improves blood flow and nutrient delivery to brain tissue. This supports oxygen and energy supply for neurons. Brain cells function more efficiently when fuel delivery improves. Cognitive processes become more reliable. A person may notice better memory and mental sharpness."
  },
  {
    "id": "phosphatidylserine_neurotransmitters_cognition_nervous_system",
    "name": "Phosphatidylserine",
    "category": "Neurotransmitters / Cognition / Nervous System",
    "mechanism": "Phosphatidylserine is a structural fat that forms part of neuron membranes. It supports signal transmission and stress regulation in brain cells. Healthy membranes allow signals to pass accurately. Stress responses become better controlled. A person may notice improved memory and reduced mental fatigue."
  },

  {
    "id": "vitamin_d3_k2_hormones_androgens_endocrine",
    "name": "Vitamin D3 + K2",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Vitamin D3 enters the body and is converted into a hormone that binds to receptors inside many cells. These receptors control genes involved in calcium balance, immune signaling, and hormone regulation. Vitamin K2 guides calcium into bones instead of soft tissue. Together, they support hormone signaling accuracy and structural balance. A person may notice stronger bones, improved immune stability, and better overall hormonal function."
  },
  {
    "id": "dhea_hormones_androgens_endocrine",
    "name": "DHEA",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "DHEA is a hormone made by the adrenal glands and acts as a building block for other hormones like testosterone and estrogen. When DHEA enters cells, it can be converted as needed based on the body’s signals. This supports hormone availability without forcing one direction. Hormone balance becomes more flexible and resilient. A person may notice improved energy, mood, and stress tolerance."
  },
  {
    "id": "tongkat_ali_fadogia_agrestis_hormones_androgens_endocrine",
    "name": "Tongkat Ali + Fadogia Agrestis",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Tongkat Ali signals the body to reduce stress-related suppression of testosterone production. Fadogia Agrestis supports signaling between the brain and the testes that encourages androgen output. Together, they influence the hormone control loop that regulates testosterone levels. Androgen signaling becomes more responsive. A person may notice increased vitality, strength, and libido."
  },
  {
    "id": "beta_ecdysterone_hormones_androgens_endocrine",
    "name": "Beta-Ecdysterone",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Beta-ecdysterone interacts with cellular protein-building pathways without acting directly on androgen receptors. It signals cells to increase protein synthesis and tissue repair. This supports muscle growth through non-hormonal anabolic signaling. Hormone systems remain unchanged while growth signals increase. A person may notice improved muscle recovery and performance."
  },
  {
    "id": "boron_hormones_androgens_endocrine",
    "name": "Boron",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Boron influences how steroid hormones are bound and released in the bloodstream. It reduces excessive binding that makes hormones inactive. This increases the amount of free, usable hormone available to tissues. Hormone signaling efficiency improves. A person may notice better strength, cognition, and joint comfort."
  },
  {
    "id": "ashwagandha_hormones_androgens_endocrine",
    "name": "Ashwagandha",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Ashwagandha reduces stress signaling from the adrenal system that interferes with hormone production. By lowering cortisol pressure, it allows reproductive and thyroid hormones to normalize. Hormonal balance shifts toward restoration instead of survival mode. A person may notice reduced stress, improved sleep, and better hormonal stability."
  },
  {
    "id": "zinc_hormones_androgens_endocrine",
    "name": "Zinc",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Zinc is a mineral required for the production and regulation of many hormones, including testosterone and thyroid hormones. It acts as a structural component for hormone-producing enzymes. When zinc is sufficient, hormone synthesis proceeds correctly. Endocrine signaling becomes more reliable. A person may notice improved immunity, hormone balance, and reproductive health."
  },
  {
    "id": "iodine_hormones_androgens_endocrine",
    "name": "Iodine",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Iodine is taken up by the thyroid gland and used to make thyroid hormones. These hormones control metabolic speed and energy use throughout the body. When iodine is available in proper amounts, thyroid signaling stays balanced. Metabolic regulation becomes stable. A person may notice improved energy and temperature regulation."
  },
  {
    "id": "selenium_hormones_androgens_endocrine",
    "name": "Selenium",
    "category": "Hormones / Androgens / Endocrine",
    "mechanism": "Selenium supports enzymes that activate and protect thyroid hormones. It also reduces oxidative stress in hormone-producing tissues. This keeps hormone conversion accurate and prevents damage. Thyroid signaling remains precise. A person may notice better metabolic balance and reduced fatigue."
  },

  {
    "id": "ashwagandha_stress_adaptation_cortisol_modulation",
    "name": "Ashwagandha",
    "category": "Stress / Adaptation / Cortisol Modulation",
    "mechanism": "Ashwagandha enters the body and interacts with stress-control centers that regulate cortisol release. It reduces excessive stress signaling from the adrenal system. This lowers constant “alert mode” pressure on the body. Hormone and nervous systems are allowed to rebalance. A person may notice reduced stress, improved sleep, and steadier energy."
  },
  {
    "id": "rhodiola_rosea_stress_adaptation_cortisol_modulation",
    "name": "Rhodiola Rosea",
    "category": "Stress / Adaptation / Cortisol Modulation",
    "mechanism": "Rhodiola affects stress-response signaling in the brain and muscles by modulating how stress chemicals are released and used. It helps prevent stress signals from overshooting during physical or mental effort. Energy systems stay active without triggering exhaustion. Adaptation to stress becomes more efficient. A person may notice improved resilience and reduced fatigue under pressure."
  },
  {
    "id": "holy_basil_tulsi_stress_adaptation_cortisol_modulation",
    "name": "Holy Basil (Tulsi)",
    "category": "Stress / Adaptation / Cortisol Modulation",
    "mechanism": "Holy Basil influences stress signaling pathways that connect the brain, adrenal glands, and immune system. It helps dampen chronic stress responses while supporting normal metabolic function. Stress chemistry becomes less reactive. The body shifts toward balance instead of constant defense. A person may notice calmer mood and improved stress tolerance."
  },
  {
    "id": "phosphatidylserine_stress_adaptation_cortisol_modulation",
    "name": "Phosphatidylserine",
    "category": "Stress / Adaptation / Cortisol Modulation",
    "mechanism": "Phosphatidylserine integrates into cell membranes in the brain and stress-regulating tissues. It helps regulate signals that control cortisol release during stress. When these signals are balanced, cortisol returns to normal levels more quickly after stress. Recovery systems engage sooner. A person may notice improved stress recovery and mental calm."
  },
  {
    "id": "magnesium_stress_modulation_role_stress_adaptation_cortisol_modulation",
    "name": "Magnesium (Stress Modulation Role)",
    "category": "Stress / Adaptation / Cortisol Modulation",
    "mechanism": "Magnesium participates in nerve and hormone signaling that limits excessive stress responses. It helps prevent overactivation of stress-related pathways. This keeps cortisol and nervous system activity from staying elevated too long. The body transitions more easily into recovery. A person may notice reduced tension and improved relaxation."
  },

  {
    "id": "n_acetyl_cysteine_nac_detoxification_redox_cellular_protection",
    "name": "N-Acetyl Cysteine (NAC)",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "NAC enters cells and is used to make glutathione, one of the body’s main protective molecules. Glutathione binds and neutralizes harmful byproducts created during normal metabolism and stress. This reduces cellular damage and supports clean chemical balance. Detox systems work more smoothly. A person may notice improved resilience and reduced oxidative stress."
  },
  {
    "id": "glutathione_or_precursors_detoxification_redox_cellular_protection",
    "name": "Glutathione (or Precursors)",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "Glutathione exists inside cells as a central cleanup molecule. It directly neutralizes reactive compounds and helps reset other antioxidants. When glutathione levels are supported, cells are better protected during stress. Damage-control systems stay active. A person may notice improved recovery and cellular resilience."
  },
  {
    "id": "sulforaphane_detoxification_redox_cellular_protection",
    "name": "Sulforaphane",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "Sulforaphane activates internal genetic switches that increase the production of detox and antioxidant enzymes. This prepares cells to handle toxins before damage occurs. Protective pathways become more active and coordinated. Long-term cellular defense improves. A person may notice improved tolerance to environmental stressors."
  },
  {
    "id": "milk_thistle_silymarin_detoxification_redox_cellular_protection",
    "name": "Milk Thistle (Silymarin)",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "Milk thistle compounds concentrate in the liver and support enzymes involved in toxin processing. They stabilize liver cells and help them repair after chemical stress. Detox pathways operate with less damage. Liver function becomes more resilient. A person may notice improved digestive comfort and recovery."
  },
  {
    "id": "resveratrol_detoxification_redox_cellular_protection",
    "name": "Resveratrol",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "Resveratrol interacts with cellular defense systems that protect DNA and mitochondria from oxidative stress. It helps regulate how cells respond to damage and aging signals. Protective maintenance pathways become more active. Cellular integrity improves over time. A person may notice long-term resilience and metabolic support."
  },
  {
    "id": "green_tea_extract_detoxification_redox_cellular_protection",
    "name": "Green Tea Extract",
    "category": "Detoxification / Redox / Cellular Protection",
    "mechanism": "Green tea compounds reduce oxidative stress by neutralizing reactive molecules and supporting detox enzymes. They also help balance inflammation that interferes with cellular cleanup. Detox processes remain efficient and controlled. Cells experience less chemical strain. A person may notice improved cellular protection and overall balance."
  },

  {
    "id": "magnesium_glycinate_sleep_calm_parasympathetic_support",
    "name": "Magnesium Glycinate",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "Magnesium glycinate enters the body and supplies magnesium to nerve and muscle cells. Magnesium helps slow down overactive nerve signals and allows relaxation signals to work properly. This shifts the nervous system away from constant alert mode. The body moves more easily into rest and recovery. A person may notice improved relaxation and easier sleep."
  },
  {
    "id": "apigenin_sleep_calm_parasympathetic_support",
    "name": "Apigenin",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "Apigenin interacts with calming receptors in the brain that reduce excessive nerve firing. It lowers mental overstimulation without shutting the brain down. Neural activity becomes quieter and more organized. The nervous system favors rest over alertness. A person may notice easier relaxation and calmer sleep onset."
  },
  {
    "id": "taurine_sleep_calm_parasympathetic_support",
    "name": "Taurine",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "Taurine acts as a balancing signal in the nervous system that limits excessive excitation. It helps control how strongly nerve cells fire during stress. This protects the brain from overload and supports calm signaling. Nervous system tone becomes smoother. A person may notice reduced tension and improved calmness."
  },
  {
    "id": "glycine_sleep_calm_parasympathetic_support",
    "name": "Glycine",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "Glycine functions as a simple inhibitory signal that slows nerve activity when the body prepares for rest. It helps lower core body activation and supports sleep-related transitions. Neural noise decreases and recovery signals increase. The body enters rest states more easily. A person may notice deeper relaxation and improved sleep quality."
  },
  {
    "id": "l_theanine_sleep_calm_parasympathetic_support",
    "name": "L-Theanine",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "L-theanine influences brain wave activity by increasing calm-focused signals while reducing stress-related firing. It promotes relaxed alertness rather than sedation. Brain activity becomes smooth and steady. Mental tension decreases without dullness. A person may notice calm focus and easier wind-down."
  },
  {
    "id": "valerian_root_sleep_calm_parasympathetic_support",
    "name": "Valerian Root",
    "category": "Sleep / Calm / Parasympathetic Support",
    "mechanism": "Valerian compounds interact with calming neurotransmitter systems that reduce nervous system excitability. They help strengthen natural signals that promote rest. Overactive signaling slows down. The body shifts toward sleep readiness. A person may notice easier sleep initiation and nighttime calm."
  },

  {
    "id": "saw_palmetto_prostate_estrogen_hormone_balance",
    "name": "Saw Palmetto",
    "category": "Prostate / Estrogen / Hormone Balance",
    "mechanism": "Saw palmetto compounds interact with enzymes that convert testosterone into stronger androgen forms. By limiting this conversion, hormone activity in certain tissues becomes less intense. This reduces excess stimulation in hormone-sensitive areas. Balance between androgen forms improves. A person may notice improved prostate comfort and urinary flow."
  },
  {
    "id": "dim_diindolylmethane_prostate_estrogen_hormone_balance",
    "name": "DIM (Diindolylmethane)",
    "category": "Prostate / Estrogen / Hormone Balance",
    "mechanism": "DIM forms in the body from compounds found in cruciferous vegetables and affects how estrogen is processed. It shifts estrogen breakdown toward less active forms. This changes the balance of estrogen signals rather than total estrogen levels. Hormone signaling becomes cleaner and more regulated. A person may notice improved hormonal balance and reduced estrogen-related symptoms."
  },
  {
    "id": "indole_3_carbinol_prostate_estrogen_hormone_balance",
    "name": "Indole-3-Carbinol",
    "category": "Prostate / Estrogen / Hormone Balance",
    "mechanism": "Indole-3-carbinol supports enzymes that process estrogen in the liver and intestines. It helps guide estrogen metabolism toward safer pathways. This reduces accumulation of stronger estrogen forms. Hormone clearance becomes more efficient. A person may notice improved estrogen balance over time."
  },
  {
    "id": "calcium_d_glucarate_prostate_estrogen_hormone_balance",
    "name": "Calcium-D-Glucarate",
    "category": "Prostate / Estrogen / Hormone Balance",
    "mechanism": "Calcium-D-glucarate supports detox enzymes that help remove used hormones from the body. It prevents hormones from being recycled once they are marked for elimination. This keeps hormone signaling from lingering too long. Estrogen levels normalize more effectively. A person may notice improved hormonal clarity and balance."
  },
  {
    "id": "zinc_hormone_balance_role_prostate_estrogen_hormone_balance",
    "name": "Zinc (Hormone Balance Role)",
    "category": "Prostate / Estrogen / Hormone Balance",
    "mechanism": "Zinc participates in enzymes that regulate both androgen and estrogen activity. It supports normal testosterone signaling while limiting excessive estrogen effects. Hormone communication stays properly regulated. Endocrine balance improves. A person may notice improved reproductive health and hormonal stability."
  },

  {
    "id": "beta_ecdysterone_structural_performance_anabolic_signaling",
    "name": "Beta-Ecdysterone",
    "category": "Structural / Performance / Anabolic Signaling",
    "mechanism": "Beta-ecdysterone enters cells and interacts with protein-building control systems without binding to androgen receptors. It signals cells to increase protein synthesis and tissue repair through non-hormonal pathways. Muscle and connective tissues receive stronger growth signals without altering hormone balance. Structural rebuilding becomes more active. A person may notice improved muscle recovery and physical performance."
  },
  {
    "id": "creatine_monohydrate_structural_performance_anabolic_signaling",
    "name": "Creatine Monohydrate",
    "category": "Structural / Performance / Anabolic Signaling",
    "mechanism": "Creatine enters muscle cells and connects to the fast-energy system that supports forceful movement. By rapidly recycling energy molecules, it allows muscles to produce power repeatedly without early fatigue. This supports stronger contractions and faster recovery between efforts. Performance capacity increases. A person may notice improved strength and exercise output."
  },
  {
    "id": "beta_alanine_structural_performance_anabolic_signaling",
    "name": "Beta-Alanine",
    "category": "Structural / Performance / Anabolic Signaling",
    "mechanism": "Beta-alanine is used to form carnosine inside muscle cells. Carnosine buffers acid that builds up during intense activity. This delays fatigue and maintains muscle function under stress. Muscles sustain performance for longer periods. A person may notice improved endurance during high-effort activity."
  },
  {
    "id": "hmb_beta_hydroxy_beta_methylbutyrate_structural_performance_anabolic_signaling",
    "name": "HMB (β-Hydroxy β-Methylbutyrate)",
    "category": "Structural / Performance / Anabolic Signaling",
    "mechanism": "HMB is a metabolite of leucine that signals muscle cells to reduce protein breakdown. It helps protect muscle tissue during stress, training, or calorie restriction. Structural loss slows while repair processes continue. Muscle integrity is preserved. A person may notice improved recovery and reduced muscle soreness."
  },
  {
    "id": "collagen_peptides_structural_performance_anabolic_signaling",
    "name": "Collagen Peptides",
    "category": "Structural / Performance / Anabolic Signaling",
    "mechanism": "Collagen peptides provide amino acids that support connective tissue repair. These amino acids are used to rebuild tendons, ligaments, skin, and joint structures. Structural tissues receive the materials needed for maintenance and resilience. Tissue strength improves gradually. A person may notice improved joint comfort and connective tissue support."
  }
]